In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("C:/Users/sumit/Downloads/titanic.csv")

In [4]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
#What is the average age of passengers?

data["Age"].mean()

np.float64(29.69911764705882)

In [6]:
#How many passengers embarked from each port?
data["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [11]:
#How many passengers had siblings/spouses aboard (SibSp > 0)?
 #data["SibSp"].value_counts().shape[0]    #incorrect way 

(data["SibSp"]>0).sum()

np.int64(283)

In [14]:
#what is the survival rate (%) by gender?

data["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [17]:
survival_rate = data.groupby("Sex")["Survived"].mean()*100     
survival_rate.round(2)                           #it round to 2 digit

Sex
female    74.20
male      18.89
Name: Survived, dtype: float64

In [19]:
#Find null values in the dataset.

data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [25]:
#Fill Age missing values with the median.

median= data["Age"].median()
median

np.float64(28.0)

In [30]:
data["Age"]= (data["Age"].replace(np.nan,median))
data["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [31]:
data["Age"].isnull().sum()

np.int64(0)

In [39]:
print("Cabin" in data.columns)

False

In [43]:
#Create a new column "FamilySize" = SibSp + Parch + 1

data["FamilySize"] = data["SibSp"]+ data["Parch"] +1
data["FamilySize"]

0      2
1      2
2      1
3      2
4      1
      ..
886    1
887    1
888    4
889    1
890    1
Name: FamilySize, Length: 891, dtype: int64

In [48]:
#Sort the dataset by "Fare" in descending order.
data.sort_values("Fare",ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,FamilySize
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,C,2
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,C,1
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,C,1
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,S,6
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,S,6
...,...,...,...,...,...,...,...,...,...,...,...,...
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,S,1
815,816,0,1,"Fry, Mr. Richard",male,28.0,0,0,112058,0.0000,S,1
466,467,0,2,"Campbell, Mr. William",male,28.0,0,0,239853,0.0000,S,1
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,28.0,0,0,239854,0.0000,S,1
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,S,1

In [50]:
#Save the cleaned dataset as titanic_cleaned.csv

data.to_csv("titanic_cleaned.csv",index = False)

In [52]:
#The average fare paid per class (Pclass)
avg_paid = data.groupby("Pclass")["Fare"].mean()
avg_paid

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [54]:
#The number of survivors per embarkation port (Embarked)

survivors = data.groupby("Embarked")["Survived"].sum()
survivors

Embarked
C     93
Q     30
S    217
Name: Survived, dtype: int64

In [55]:
#How many passengers were children (Age < 18)?

(data["Age"] < 18 ).sum()

np.int64(113)

In [57]:
#What was the average fare paid by survivors vs. non-survivors?

avg_fare = data.groupby("Embarked")["Survived"].mean()
avg_fare

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [60]:
#Find the survival rate for each Pclass.
survival_rate = data.groupby("Pclass")["Survived"].mean()*100
survival_rate

Pclass
1    62.962963
2    47.282609
3    24.236253
Name: Survived, dtype: float64

In [63]:
#How many passengers traveled alone (FamilySize == 1)?

alone = (data["FamilySize"] == 1).sum()
alone

np.int64(537)

In [73]:
#Which 5 passengers paid the highest fare?

highest_fare = data.sort_values("Fare", ascending=False).head(5)
highest_fare[["Name", "Fare"]]

                                   Name      Fare
679  Cardeza, Mr. Thomas Drake Martinez  512.3292
258                    Ward, Miss. Anna  512.3292
737              Lesurer, Mr. Gustave J  512.3292
88           Fortune, Miss. Mabel Helen  263.0000
438                   Fortune, Mr. Mark  263.0000

In [ ]:
data["FamilySize"].max()